In [1]:
%matplotlib notebook
import matplotlib.pyplot as plt
import numpy as np
import random
import pandas as pd

In [29]:
student_info=[['John', 32, 421211, 'Sales', 'Florida'],
              ['Jim', 22, 187112, 'Facilties', 'California'],
              ['Joe', 41, 512111, 'Technology', 'Florida'],
              ['Jack', 42, 499123, 'Technology', 'Florida'],
              ['Kim', 51, 613221,'Management', 'California'],
              ['Lynn', 23, 164444,'Sales', 'California'],
              ['Bob', 31, 253122,'Accounts', 'Florida'],
              ['Adam', 27, 211412,'Technology', 'Florida'],
              ['Paul', 37, 378123,'HR', 'California'],
              ['Samantha', 21, 142122,  'HR', 'Florida']]

In [30]:
dataframe_student_info=pd.DataFrame(student_info, columns=['Name', 'Age', 'Annual Salary', 'Department', 'State'])

In [31]:
dataframe_student_info

       Name  Age  Annual Salary  Department       State
0      John   32         421211       Sales     Florida
1       Jim   22         187112   Facilties  California
2       Joe   41         512111  Technology     Florida
3      Jack   42         499123  Technology     Florida
4       Kim   51         613221  Management  California
5      Lynn   23         164444       Sales  California
6       Bob   31         253122    Accounts     Florida
7      Adam   27         211412  Technology     Florida
8      Paul   37         378123          HR  California
9  Samantha   21         142122          HR     Florida

In [46]:
department_group=dataframe_student_info['Annual Salary'].groupby(dataframe_student_info['Department'])

In [47]:
department_group.sum()

Department
Accounts       253122
Facilties      187112
HR             520245
Management     613221
Sales          585655
Technology    1222646
Name: Annual Salary, dtype: int64

In [48]:
department_group.mean()

Department
Accounts      253122.000000
Facilties     187112.000000
HR            260122.500000
Management    613221.000000
Sales         292827.500000
Technology    407548.666667
Name: Annual Salary, dtype: float64

In [36]:
department_sal_group_dual=dataframe_student_info['Annual Salary'].groupby([dataframe_student_info['Department'], dataframe_student_info['State']])

In [38]:
department__sal_group_dual.mean()

Department  State
Accounts    Florida       253122.000000
Facilties   California    187112.000000
HR          California    378123.000000
            Florida       142122.000000
Management  California    613221.000000
Sales       California    164444.000000
            Florida       421211.000000
Technology  Florida       407548.666667
Name: Annual Salary, dtype: float64

In [40]:
department_age_group_dual.mean().unstack()

State       California        Florida
Department
Accounts           NaN  253122.000000
Facilties     187112.0            NaN
HR            378123.0  142122.000000
Management    613221.0            NaN
Sales         164444.0  421211.000000
Technology         NaN  407548.666667

In [51]:
for name, group in dataframe_student_info.groupby('Department'):
    print(name, group)

Accounts   Name  Age  Annual Salary Department    State
6  Bob   31         253122   Accounts  Florida
Facilties   Name  Age  Annual Salary Department       State
1  Jim   22         187112  Facilties  California
HR        Name  Age  Annual Salary Department       State
8      Paul   37         378123         HR  California
9  Samantha   21         142122         HR     Florida
Management   Name  Age  Annual Salary  Department       State
4  Kim   51         613221  Management  California
Sales    Name  Age  Annual Salary Department       State
0  John   32         421211      Sales     Florida
5  Lynn   23         164444      Sales  California
Technology    Name  Age  Annual Salary  Department    State
2   Joe   41         512111  Technology  Florida
3  Jack   42         499123  Technology  Florida
7  Adam   27         211412  Technology  Florida

In [45]:
department_department_group.groupby('Department')

AttributeError: Cannot access callable attribute 'groupby' of 'SeriesGroupBy' objects, try using the 'apply' method